app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT  "students".* FROM "students" ORDER BY "students"."id" DESC LIMIT ?  [["LIMIT", 1]]